horvi24/STM32start/G071RB_dmx-my9291/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PWM_PERIOD 1000
#define PWM_B_INIT 240
#define KEY_Pin GPIO_PIN_13
#define KEY_GPIO_Port GPIOC
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOF
#define USART2_TX_Pin GPIO_PIN_2
#define USART2_TX_GPIO_Port GPIOA
#define USART2_RX_Pin GPIO_PIN_3
#define USART2_RX_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_5
#define LED_GPIO_Port GPIOA
#define PWM_R_Pin GPIO_PIN_6
#define PWM_R_GPIO_Port GPIOA
#define PWM_G_Pin GPIO_PIN_7
#define PWM_G_GPIO_Port GPIOA
#define PWM_B_Pin GPIO_PIN_0
#define PWM_B_GPIO_Port GPIOB
#define PWM_W_Pin GPIO_PIN_1
#define PWM_W_GPIO_Port GPIOB
#define DBG_OUT7_Pin GPIO_PIN_2
#define DBG_OUT7_GPIO_Port GPIOB
#define DBG_OUT4_Pin GPIO_PIN_10
#define DBG_OUT4_GPIO_Port GPIOB
#define DBG_OUT3_Pin GPIO_PIN_13
#define DBG_OUT3_GPIO_Port GPIOB
#define DBG_OUT5_Pin GPIO_PIN_15
#define DBG_OUT5_GPIO_Port GPIOB
#define DBG_OUT2_Pin GPIO_PIN_8
#define DBG_OUT2_GPIO_Port GPIOD
#define DBG_OUT1_Pin GPIO_PIN_9
#define DBG_OUT1_GPIO_Port GPIOD
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define LED_DCKI_Pin GPIO_PIN_3
#define LED_DCKI_GPIO_Port GPIOB
#define LED_DI_Pin GPIO_PIN_5
#define LED_DI_GPIO_Port GPIOB
#define DBG_OUT6_Pin GPIO_PIN_6
#define DBG_OUT6_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
